uhnp/src/InformationRegisters/НастройкиОповещений/НастройкиОповещений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиОповещений</name>
  <resources>
    <name>ШаблонОповещения</name>
    <type>
      <types>CatalogRef.ШаблоныОповещений</types>
      <types>CatalogRef.УдалитьХранилищеШаблонов</types>
    </type>
  </resources>
  <resources>
    <name>СписокРассылкиПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>СписокРассылки</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ОповещениеВключено</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВнешняяПечатнаяФорма</name>
    <type>
      <types>CatalogRef.ДополнительныеОтчетыИОбработки</types>
    </type>
  </resources>
  <attributes>
    <name>ПериодНапоминания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИнтервалВремениНапоминания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПериодПослеСобытия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>КатегорияОповещения</name>
    <type>
      <types>CatalogRef.КатегорииСобытийОповещений</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидСобытияОповещения</name>
    <type>
      <types>CatalogRef.ВидыСобытийОповещений</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипОбъектаОповещения</name>
    <type>
      <types>CatalogRef.ДокументыБД</types>
      <types>CatalogRef.СправочникиБД</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидОбъектаОповещения</name>
    <type>
      <types>CatalogRef.ВидыОперацийУХ</types>
      <types>CatalogRef.ШаблоныУниверсальныхПроцессов</types>
      <types>CatalogRef.ЭтапыУниверсальныхПроцессов</types>
      <types>EnumRef.ВидыМероприятий</types>
      <types>CatalogRef.ВидыОтчетов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УдалитьВидОбъектаОповещения</name>
    <type>
      <types>CatalogRef.ШаблоныУниверсальныхПроцессов</types>
      <types>CatalogRef.ЭтапыУниверсальныхПроцессов</types>
      <types>EnumRef.ВидыМероприятий</types>
      <types>CatalogRef.ВидыОтчетов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/Enums/ТипыШаблонов/ТипыШаблонов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыШаблонов</name>
  <enumValues>
    <name>Табличный</name>
  </enumValues>
  <enumValues>
    <name>Текстовый</name>
  </enumValues>
  <enumValues>
    <name>HTML</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Catalogs/ШаблоныОповещений/ШаблоныОповещений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ШаблоныОповещений</name>
  <predefined>
    <items>
      <name>ОценкаПоставщиков</name>
      <description>Оценка поставщиков</description>
    </items>
  </predefined>
  <attributes>
    <name>ТипШаблона</name>
    <type>
      <types>EnumRef.ТипыШаблонов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПользовательСоздал</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Шаблон</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ПользовательИзменил</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтапПроцесса</name>
    <type>
      <types>CatalogRef.ЭтапыУниверсальныхПроцессов</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонПроцесса</name>
    <type>
      <types>CatalogRef.ШаблоныУниверсальныхПроцессов</types>
    </type>
  </attributes>
  <attributes>
    <name>НазначениеОповещения</name>
    <type>
      <types>CatalogRef.ВидыСобытийОповещений</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОбъектаОповещения</name>
    <type>
      <types>CatalogRef.ШаблоныУниверсальныхПроцессов</types>
      <types>CatalogRef.ЭтапыУниверсальныхПроцессов</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОбъектаОповещения</name>
    <type>
      <types>CatalogRef.ДокументыБД</types>
      <types>CatalogRef.СправочникиБД</types>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияОповещения</name>
    <type>
      <types>CatalogRef.КатегорииСобытийОповещений</types>
    </type>
  </attributes>
  <attributes>
    <name>НестандартныйШаблон</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокОтветственных</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
        <types>CatalogRef.РолиКонтактныхЛиц</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

uhnp/src/Catalogs/КатегорииСобытийОповещений/КатегорииСобытийОповещений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КатегорииСобытийОповещений</name>
  <predefined>
    <items>
      <name>Напоминания</name>
      <description>Напоминания</description>
    </items>
    <items>
      <name>Ошибки</name>
      <description>Оповещения для администратора инф. базы</description>
    </items>
    <items>
      <name>ОповещенияЭтапаПроцесса</name>
      <description>Оповещения этапов процесса</description>
    </items>
    <items>
      <name>ОценкаАльтернатив</name>
      <description>Оценка альтернатив</description>
    </items>
    <items>
      <name>ПотребностьВРесурсахЗакупок</name>
      <description>Потребность в ресурсах закупок</description>
    </items>
    <items>
      <name>СобытияВыполненияПроцесса</name>
      <description>Процесс - общие события процессов</description>
    </items>
    <items>
      <name>СобытияСогласования</name>
      <description>Процесс - события согласования</description>
    </items>
    <items>
      <name>СобытияЭтапаОбработка</name>
      <description>Процесс - этап &quot;Обработка&quot;</description>
    </items>
    <items>
      <name>СобытияЭтапаРучнойПереход</name>
      <description>Процесс - этап &quot;Переход по выбору&quot;</description>
    </items>
    <items>
      <name>СобытияПроцессаПодготовкиОтчетности</name>
      <description>Процесс - этап &quot;Подготовка отчетности&quot;</description>
    </items>
    <items>
      <name>СобытияГПЗ</name>
      <description>События годовой программы закупок</description>
    </items>
    <items>
      <name>СобытияМонитораКлючевыхПоказателей</name>
      <description>События монитора ключевых показателей</description>
    </items>
    <items>
      <name>АккредитацияПоставщиков</name>
      <description>События по аккредитации поставщиков</description>
    </items>
    <items>
      <name>СобытияДоговоров</name>
      <description>События по договорам</description>
    </items>
    <items>
      <name>ОплатаЗаявок</name>
      <description>События по заявкам на оплату</description>
    </items>
    <items>
      <name>СобытияПоКорректировкамЛимитов</name>
      <description>События по корректировкам лимитов</description>
    </items>
    <items>
      <name>СобытияПоМероприятиям</name>
      <description>События по мероприятиям</description>
    </items>
    <items>
      <name>СобытияПроектов</name>
      <description>События по проектам</description>
    </items>
    <items>
      <name>СобытияПоЭкспертизе</name>
      <description>События по экспертизе</description>
    </items>
  </predefined>
  <attributes>
    <name>ОповещаемыеПоУмолчанию</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьСкрытаяКатегория</name>
    <comment>Не отображается пользователям</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Представления</name>
    <attributes>
      <name>КодЯзыка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

uhnp/src/InformationRegisters/НастройкиОповещений/Forms/ФормаЗаписи/Module.bsl
// Выводит в подсказке поля Событие системы Описание этого события.
&НаСервере
Процедура ОтобразитьОписаниеСобытияВПодсказке()
	Если ЗначениеЗаполнено(Запись.ВидСобытияОповещения)	Тогда
		Если ЗначениеЗаполнено(Запись.ВидСобытияОповещения.Описание) Тогда
			Элементы.ВидСобытияОповещения.Подсказка = Запись.ВидСобытияОповещения.Описание;
		Иначе
			Элементы.ВидСобытияОповещения.Подсказка = НСтр("ru = '<Отсутствует описание для данного события системы>'");
		КонецЕсли;
	Иначе
		Элементы.ВидСобытияОповещения.Подсказка = НСтр("ru = '<Выберите требуемое событие системы>'");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// Установим данные заполнения по параметрам, если это новая запись.
	Если Не ЗначениеЗаполнено(Параметры.Ключ) Тогда
		// Параметр Категория оповещения.
		Если ЗначениеЗаполнено(Параметры.КатегорияОповещения) Тогда
			Запись.КатегорияОповещения = Параметры.КатегорияОповещения;
		Иначе
			// Не заполняем пустое.
		КонецЕсли;
		// Параметр Вид события оповещения.
		Если ЗначениеЗаполнено(Параметры.ВидСобытияОповещения) Тогда
			Запись.ВидСобытияОповещения = Параметры.ВидСобытияОповещения;
		Иначе
			// Не заполняем пустое.
		КонецЕсли;
		// Параметр Тип объекта оповещения.
		Если ЗначениеЗаполнено(Параметры.ТипОбъектаОповещения) Тогда
			Запись.ТипОбъектаОповещения = Параметры.ТипОбъектаОповещения;
		Иначе
			// Не заполняем пустое.
		КонецЕсли;
		// Параметр Вид объекта оповещения.
		Если ЗначениеЗаполнено(Параметры.ВидОбъектаОповещения) Тогда
			Запись.ВидОбъектаОповещения = Параметры.ВидОбъектаОповещения;
		Иначе
			// Не заполняем пустое.
		КонецЕсли;
	Иначе
		// Для уже существующих не изменяем данные.
	КонецЕсли;
	// Очистим шаблон при копировании записи.
    Копирование = ЗначениеЗаполнено(Параметры.ЗначениеКопирования);
	Если Копирование Тогда
		Запись.ШаблонОповещения = Справочники.ШаблоныОповещений.ПустаяСсылка();
	Иначе
		// Не нужна очистка.
	КонецЕсли;
	// Обновление интерфейса.
	УстановитьДоступностьЭлементов();	
	ОтобразитьОписаниеСобытияВПодсказке();
	
КонецПроцедуры

// Скрывает или отображает реквизиты, спецэффические для событий Напоминаний.
&НаСервере
Процедура УстановитьВидимостьРеквизитовНапоминания()
	ЭтоНапоминание = (Запись.КатегорияОповещения = Справочники.КатегорииСобытийОповещений.Напоминания);
	Элементы.ГруппаНастройкиНапоминаний.Видимость = ЭтоНапоминание;
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступностьЭлементов()
	
	УстановитьВидимостьРеквизитовНапоминания();
	Если  РеквизитФормыВЗначение("Запись").Выбран() Тогда
		Элементы.КатегорияОповещения.Доступность = Ложь;		 	
		Элементы.ТипОбъектаОповещения.Доступность = Ложь;
		Элементы.ВидОбъектаОповещения.Доступность = Ложь;
		Возврат;
	Иначе	
		Запись.ОповещениеВключено = Истина;
	КонецЕсли;
	
	ТекИБ = Справочники.ТипыБазДанных.ТекущаяИБ; 
	Элементы.ТипОбъектаОповещения.Доступность = Истина;
    Элементы.ВидОбъектаОповещения.Доступность = ЗначениеЗаполнено(Запись.ТипОбъектаОповещения);
	НовоеОграничениеТипа = МодульУправленияОповещениямиУХ.ПолучитьОграниченияТипаДляВидаОбъектаОповещения(Запись.КатегорияОповещения, Запись.ВидСобытияОповещения, Запись.ТипОбъектаОповещения);
	Если Запись.КатегорияОповещения = Справочники.КатегорииСобытийОповещений.СобытияВыполненияПроцесса Тогда
		
		Элементы.ТипОбъектаОповещения.Доступность = Ложь;
		Запись.ТипОбъектаОповещения = Справочники.ДокументыБД.НайтиПоНаименованию("ЭкземплярПроцесса",,, ТекИБ);  
		Элементы.ВидОбъектаОповещения.Доступность = ЗначениеЗаполнено(Запись.ТипОбъектаОповещения);
		Элементы.ВидОбъектаОповещения.ОграничениеТипа = НовоеОграничениеТипа; 
			
	ИначеЕсли Запись.КатегорияОповещения = Справочники.КатегорииСобытийОповещений.СобытияСогласования Тогда	
		
		Запись.ВидОбъектаОповещения = Неопределено;
		Элементы.ВидОбъектаОповещения.Доступность = ЗначениеЗаполнено(Запись.ТипОбъектаОповещения);
		Если Запись.ТипОбъектаОповещения = Справочники.ДокументыБД.НайтиПоНаименованию("ЗаявкаНаРасходованиеДенежныхСредств",,, ТекИБ) Тогда
			 Элементы.ВидОбъектаОповещения.ОграничениеТипа = НовоеОграничениеТипа; 
			
		ИначеЕсли Запись.ТипОбъектаОповещения = Справочники.ДокументыБД.НайтиПоНаименованию("НастраиваемыйОтчет",,, ТекИБ) Тогда
			 Элементы.ВидОбъектаОповещения.ОграничениеТипа = НовоеОграничениеТипа; 
		Иначе	
			 Элементы.ВидОбъектаОповещения.Доступность = Ложь;
		КонецЕсли;	
	
	ИначеЕсли Запись.КатегорияОповещения = Справочники.КатегорииСобытийОповещений.ОплатаЗаявок Тогда	
		
		Запись.ТипОбъектаОповещения = Справочники.ДокументыБД.НайтиПоНаименованию("ЗаявкаНаРасходованиеДенежныхСредств",,, ТекИБ);
		Элементы.ТипОбъектаОповещения.Доступность = Ложь;	
		Элементы.ВидОбъектаОповещения.Доступность = ЗначениеЗаполнено(Запись.ТипОбъектаОповещения);
		Элементы.ВидОбъектаОповещения.ОграничениеТипа = НовоеОграничениеТипа; 

		
	ИначеЕсли Запись.КатегорияОповещения = Справочники.КатегорииСобытийОповещений.СобытияДоговоров Тогда	
		
		Запись.ТипОбъектаОповещения = Справочники.СправочникиБД.НайтиПоНаименованию("ДоговорыКонтрагентов",,, ТекИБ);
		Элементы.ТипОбъектаОповещения.Доступность = Ложь;	
		Запись.ВидОбъектаОповещения = Неопределено;
		Элементы.ВидОбъектаОповещения.Доступность = Ложь;
		
	ИначеЕсли Запись.КатегорияОповещения = Справочники.КатегорииСобытийОповещений.СобытияПроектов Тогда	
		
		Запись.ТипОбъектаОповещения = Справочники.СправочникиБД.НайтиПоНаименованию("Проекты",,, ТекИБ);
		Элементы.ТипОбъектаОповещения.Доступность = Ложь;	
		Запись.ВидОбъектаОповещения = Неопределено;
		Элементы.ВидОбъектаОповещения.Доступность = Ложь;
	
	ИначеЕсли Запись.КатегорияОповещения = Справочники.КатегорииСобытийОповещений.СобытияПроцессаПодготовкиОтчетности Тогда	
		
		Запись.ТипОбъектаОповещения = Справочники.СправочникиБД.НайтиПоНаименованию("ЭтапыУниверсальныхПроцессов",,, ТекИБ);
		Элементы.ТипОбъектаОповещения.Доступность = Ложь;	
		Запись.ВидОбъектаОповещения = Неопределено;
		Элементы.ВидОбъектаОповещения.ОграничениеТипа = НовоеОграничениеТипа; 
		Элементы.ВидОбъектаОповещения.Доступность = Истина;
		
	ИначеЕсли Запись.КатегорияОповещения = Справочники.КатегорииСобытийОповещений.Напоминания Тогда	
		
		Если Запись.ТипОбъектаОповещения = Справочники.ДокументыБД.НайтиПоНаименованию("Мероприятие",,, ТекИБ) Тогда
			Элементы.ВидОбъектаОповещения.Доступность = ЗначениеЗаполнено(Запись.ТипОбъектаОповещения);
			Элементы.ВидОбъектаОповещения.ОграничениеТипа = НовоеОграничениеТипа; 
		Иначе	
			Элементы.ТипОбъектаОповещения.Доступность = Ложь;	
			Запись.ВидОбъектаОповещения = Неопределено;
			Элементы.ВидОбъектаОповещения.Доступность = Ложь;
		КонецЕсли;
		
	ИначеЕсли Запись.КатегорияОповещения = Справочники.КатегорииСобытийОповещений.СобытияМонитораКлючевыхПоказателей Тогда	
		
		Запись.ТипОбъектаОповещения = Справочники.СправочникиБД.НайтиПоНаименованию("ПроизвольныеОтчеты",,, ТекИБ);
		Элементы.ТипОбъектаОповещения.Доступность = Ложь;	
		Запись.ВидОбъектаОповещения = Неопределено;
		Элементы.ВидОбъектаОповещения.Доступность = Ложь;
		
	КонецЕсли;	
	
		
КонецПроцедуры

// Устанавливает значение поля СвязанныйОбъект, если его можно определеить однозначно
// для вида события ВидСобытияВход
&НаСервере
Процедура УстановитьСвязанныйОбъект(ВидСобытияВход)
	НовыйТипОбъекта = МодульУправленияОповещениямиУХ.ПолучитьТипОбъектаПоВидуОповещения(ВидСобытияВход);
	Если ЗначениеЗаполнено(НовыйТипОбъекта) Тогда
		Запись.ТипОбъектаОповещения = НовыйТипОбъекта;
	Иначе
		// Не ограничиваем тип объекта оповещения.
	КонецЕсли;
КонецПроцедуры

// Возвращает ссылку на хранилище шаблонов, привязанного к данному шаблону. В случае, когда 
// таких шаблонов несколько - будет возвращена первая по алфавиту. В случае отсутсвия - будет
// создан новый элемент справочника.
&НаСервере
Функция ПолучитьСсылкуНаШаблонОповещения()
	// Проверим существование шаблона в базе.
			
	Если НЕ ЗначениеЗаполнено(Запись.ШаблонОповещения) ИЛИ ТипЗнч(Запись.ШаблонОповещения) <> Тип("СправочникСсылка.ШаблоныОповещений") Тогда
		
		РезультатФункции = Справочники.ШаблоныОповещений.ПустаяСсылка();
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	ШаблоныОповещений.Ссылка КАК Ссылка,
		|	ШаблоныОповещений.НазначениеОповещения КАК НазначениеОповещения,
		|	ШаблоныОповещений.КатегорияОповещения КАК КатегорияОповещения,
		|	ШаблоныОповещений.ТипОбъектаОповещения КАК ТипОбъектаОповещения
		|ИЗ
		|	Справочник.ШаблоныОповещений КАК ШаблоныОповещений
		|ГДЕ
		|	ШаблоныОповещений.НазначениеОповещения = &ВидСобытияОповещения
		|	И ШаблоныОповещений.ТипОбъектаОповещения = &ТипОбъектаОповещения
		|	И ШаблоныОповещений.КатегорияОповещения = &КатегорияОповещения
		|	И ШаблоныОповещений.ВидОбъектаОповещения = &ВидОбъектаОповещения
		|
		|УПОРЯДОЧИТЬ ПО
		|	ШаблоныОповещений.Наименование";
		ТипОбъектаОповещенияЗапись	 = Запись.ТипОбъектаОповещения;
		ВидСобытияОповещенияЗапись	 = Запись.ВидСобытияОповещения;
		КатегорияОповещенияЗапись	 = Запись.КатегорияОповещения;
		ВидОбъектаОповещенияЗапись	 = Запись.ВидОбъектаОповещения;
		Запрос.УстановитьПараметр("ВидСобытияОповещения",	 ВидСобытияОповещенияЗапись);
		Запрос.УстановитьПараметр("КатегорияОповещения",	 КатегорияОповещенияЗапись);
		Запрос.УстановитьПараметр("ТипОбъектаОповещения",	 ТипОбъектаОповещенияЗапись);
		Запрос.УстановитьПараметр("ВидОбъектаОповещения",	 ВидОбъектаОповещенияЗапись);
		РезультатЗапроса = Запрос.Выполнить();
		Если РезультатЗапроса.Пустой() Тогда
			// Шаблона ещё нет. Создадим новый.
			Попытка
				СтруктураИзмерений = Новый Структура;
				СтруктураИзмерений.Вставить("КатегорияОповещения", КатегорияОповещенияЗапись);
				СтруктураИзмерений.Вставить("ВидСобытияОповещения", ВидСобытияОповещенияЗапись);
				СтруктураИзмерений.Вставить("ТипОбъектаОповещения", ТипОбъектаОповещенияЗапись);
				СтруктураИзмерений.Вставить("ВидОбъектаОповещения", ВидОбъектаОповещенияЗапись);
				РезультатФункции = УправлениеШаблонамиУХ.СоздатьШаблонПоСтруктуреСобытия(СтруктураИзмерений);
			Исключение
				ТекстСообщения = НСтр("ru = 'Не удалось создать шаблон оповещения: %ОписаниеОшибки%'");
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ОписаниеОшибки%", ОписаниеОшибки());
				ОбщегоНазначенияУХ.СообщитьОбОшибке(ТекстСообщения);
				РезультатФункции = Справочники.ШаблоныОповещений.ПустаяСсылка();
			КонецПопытки;
		Иначе	
			// Шаблон существует. Вернём ссылку на него.
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				РезультатФункции = ВыборкаДетальныеЗаписи.Ссылка;
			КонецЦикла;
		КонецЕсли;
	Иначе
		РезультатФункции = Запись.ШаблонОповещения;
	КонецЕсли;
	Возврат РезультатФункции;
КонецФункции

// Получает текст шаблона СсылкаНаШаблонВход
&НаСервере
Функция ПолучитьТекстШаблона(СсылкаНаШаблонВход)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ШаблоныОповещений.Ссылка КАК Ссылка,
		|	ШаблоныОповещений.Шаблон КАК Шаблон
		|ИЗ
		|	Справочник.ШаблоныОповещений КАК ШаблоныОповещений
		|ГДЕ
		|	ШаблоныОповещений.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", СсылкаНаШаблонВход);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	РезультатФункции = "";
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Попытка
			ХранилищеШаблон = ВыборкаДетальныеЗаписи.Шаблон;
			РезультатФункции = ХранилищеШаблон.Получить();
		Исключение
			РезультатФункции = "";
		КонецПопытки;
	КонецЦикла;
	Возврат РезультатФункции;
КонецФункции

// Открывает сопоставленный шаблон оповещения.
&НаКлиенте
Процедура ОткрытьВыбранныйШаблонОповещения()
	ЗаполненыОбязательныеПараметры = (ЗначениеЗаполнено(Запись.КатегорияОповещения)) И (ЗначениеЗаполнено(Запись.ВидСобытияОповещения));
	Если ЗаполненыОбязательныеПараметры Тогда
		СсылкаНаШаблон = ПолучитьСсылкуНаШаблонОповещения();
		Если ЗначениеЗаполнено(СсылкаНаШаблон) Тогда
			ЭтаФорма.Модифицированность = Истина;
			Запись.ШаблонОповещения = СсылкаНаШаблон;
			СтруктураПараметров = Новый Структура;
			СтруктураПараметров.Вставить("СсылкаНаОбъект", СсылкаНаШаблон);
			СтруктураПараметров.Вставить("ТипШаблона", ПредопределенноеЗначение("Перечисление.ТипыШаблонов.HTML"));
			СтруктураПараметров.Вставить("ТипОбъектаОповещения", Запись.ТипОбъектаОповещения);
			СтруктураПараметров.Вставить("ВидОбъектаОповещения", Запись.ВидОбъектаОповещения);
			СтруктураПараметров.Вставить("НазначениеОповещения", Запись.КатегорияОповещения);
			СтруктураПараметров.Вставить("ВидСобытияОповещения", Запись.ВидСобытияОповещения);
			СтруктураПараметров.Вставить("ЗаписыватьШаблон", Истина);
			
			Если ТипЗнч(СсылкаНаШаблон) = Тип("СправочникСсылка.ШаблоныОповещений") тогда
				СтруктураПараметров.Вставить("Шаблон", ПолучитьТекстШаблона(СсылкаНаШаблон));
				ОткрытьФорму("Справочник.ШаблоныОповещений.Форма.ФормаРедактированияШаблона", СтруктураПараметров, Элементы.ШаблонОповещения, , , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);			
			КонецЕсли;
		Иначе
			ТекстСообщения = НСтр("ru = 'Не удалось получить шаблон оповещения'");
			ОбщегоНазначенияУХ.СообщитьОбОшибке(ТекстСообщения);
		КонецЕсли;
	Иначе
		ТекстСообщения = НСтр("ru = 'Необходимо заполнить Категорию и Вид события оповещения'");
		ОбщегоНазначенияУХ.СообщитьОбОшибке(ТекстСообщения);
	КонецЕсли;
КонецПроцедуры		// ОткрытьВыбранныйШаблонОповещения()

&НаКлиенте
Процедура ТипОбъектаОповещенияСсылкаПриИзменении(Элемент)
	
	Запись.ТипОбъектаОповещения = ТипОбъектаОповещенияСсылка;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокРассылкиПредставлениеПриИзменении(Элемент)
	
	СписокРассылкиПредставлениеПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокРассылкиПредставлениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Оповещение = Новый ОписаниеОповещения("ИзменениеСпискаОтветственных", ЭтаФорма);

	ОткрытьФорму("РегистрСведений.НастройкиОповещений.Форма.ФормаРедактированияОтветственных",
	Новый Структура("ИсходныйСписок,НазначениеОповещения,ТипОбъектаОповещения,ВидОбъектаОповещения",Запись.СписокРассылки,Запись.КатегорияОповещения,Запись.ТипОбъектаОповещения,Запись.ВидОбъектаОповещения) 
	, ЭтаФорма,,,,Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
КонецПроцедуры

&НаКлиенте
Процедура ТипОбъектаОповещенияПриИзменении(Элемент)
	
	УстановитьДоступностьЭлементов();
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменениеСпискаОтветственных(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	
	Запись.СписокРассылкиПредставление = Результат.СписокРассылкиПредставление;
	Запись.СписокРассылки = Результат.СписокРассылки;
	
КонецПроцедуры

&НаКлиенте
Процедура КатегорияОповещенияПриИзменении(Элемент)
	
	СброситьЗначения();
	УстановитьДоступностьЭлементов();
	
КонецПроцедуры

&НаСервере
Процедура СписокРассылкиПредставлениеПриИзмененииНаСервере()
	
	Если Не ЗначениеЗаполнено(Запись.СписокРассылкиПредставление) Тогда
		 Запись.СписокРассылки = "";
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура СброситьЗначения()
	
	Запись.ТипОбъектаОповещения = Неопределено;
	Запись.ВидОбъектаОповещения = Неопределено;
	Запись.СписокРассылки = "";
	Запись.СписокРассылкиПредставление = "";
	Запись.ШаблонОповещения = "";
	
КонецПроцедуры	

&НаКлиенте
Процедура ВидСобытияОповещенияПриИзменении(Элемент)
	ВидСобытия = Запись.ВидСобытияОповещения;
	УстановитьСвязанныйОбъект(ВидСобытия);
	ОтобразитьОписаниеСобытияВПодсказке();
	УстановитьДоступностьЭлементов();
КонецПроцедуры

&НаКлиенте
Процедура ШаблонОповещенияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры 

&НаКлиенте
Процедура ШаблонОповещенияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ШаблонОповещенияОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОткрытьВыбранныйШаблонОповещения();
КонецПроцедуры

&НаКлиенте
Процедура ШаблонОповещенияНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ШаблонОповещенияСоздание(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ШаблонОповещенияАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьШаблонОповещения(Команда)
	ОткрытьВыбранныйШаблонОповещения();
КонецПроцедуры
